work/log.ltccip8.2020-06-03_1400/pgbench-timed-rw-small/iter-0/pgbench/logs/pgbench-1.log
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1066
query mode: simple
number of clients: 1
number of threads: 1
duration: 300 s
number of transactions actually processed: 16235
latency average = 18.480 ms
tps = 54.111921 (including connections establishing)
tps = 54.113180 (excluding connections establishing)
statement latencies in milliseconds:
         0.002  \set aid random(1, 100000 * :scale)
         0.001  \set bid random(1, 1 * :scale)
         0.001  \set tid random(1, 10 * :scale)
         0.001  \set delta random(-5000, 5000)
         0.046  BEGIN;
         0.156  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
         0.105  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
         0.118  UPDATE pgbench_tellers SET tbalance = tbalance + :delta WHERE tid = :tid;
         0.115  UPDATE pgbench_branches SET bbalance = bbalance + :delta WHERE bid = :bid;
         0.093  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
        17.842  END;