work/log.ltccip8.2020-06-03_1400/pgbench-timed-rw-small/iter-0/pgbench/logs/pgbench-12.log
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1066
query mode: simple
number of clients: 12
number of threads: 3
duration: 300 s
number of transactions actually processed: 85000
latency average = 42.357 ms
tps = 283.308565 (including connections establishing)
tps = 283.310987 (excluding connections establishing)
statement latencies in milliseconds:
         0.001  \set aid random(1, 100000 * :scale)
         0.001  \set bid random(1, 1 * :scale)
         0.001  \set tid random(1, 10 * :scale)
         0.001  \set delta random(-5000, 5000)
         0.078  BEGIN;
         0.222  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
         0.144  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
         0.176  UPDATE pgbench_tellers SET tbalance = tbalance + :delta WHERE tid = :tid;
         0.366  UPDATE pgbench_branches SET bbalance = bbalance + :delta WHERE bid = :bid;
         0.117  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
        41.275  END;