work/log.ltccip8.2020-06-03_1400/pgbench-timed-rw-small/iter-0/pgbench/logs/pgbench-21.log
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1066
query mode: simple
number of clients: 21
number of threads: 3
duration: 300 s
number of transactions actually processed: 148858
latency average = 42.327 ms
tps = 496.138696 (including connections establishing)
tps = 496.142724 (excluding connections establishing)
statement latencies in milliseconds:
         0.001  \set aid random(1, 100000 * :scale)
         0.001  \set bid random(1, 1 * :scale)
         0.001  \set tid random(1, 10 * :scale)
         0.001  \set delta random(-5000, 5000)
         0.119  BEGIN;
         0.248  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
         0.170  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
         0.221  UPDATE pgbench_tellers SET tbalance = tbalance + :delta WHERE tid = :tid;
         0.570  UPDATE pgbench_branches SET bbalance = bbalance + :delta WHERE bid = :bid;
         0.134  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
        40.884  END;