work/log.ltccip8.2020-06-03_1400/pgbench-timed-rw-small/iter-0/pgbench/logs/pgbench-5.log
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1066
query mode: simple
number of clients: 5
number of threads: 3
duration: 300 s
number of transactions actually processed: 41320
latency average = 36.306 ms
tps = 137.720103 (including connections establishing)
tps = 137.722657 (excluding connections establishing)
statement latencies in milliseconds:
         0.002  \set aid random(1, 100000 * :scale)
         0.001  \set bid random(1, 1 * :scale)
         0.001  \set tid random(1, 10 * :scale)
         0.000  \set delta random(-5000, 5000)
         0.055  BEGIN;
         0.178  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
         0.115  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
         0.133  UPDATE pgbench_tellers SET tbalance = tbalance + :delta WHERE tid = :tid;
         0.210  UPDATE pgbench_branches SET bbalance = bbalance + :delta WHERE bid = :bid;
         0.098  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
        35.515  END;