work/log.ltccip8.2020-06-03_1400/pgbench-timed-rw-small/iter-0/pgbench/logs/pgbench-80.log
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1066
query mode: simple
number of clients: 80
number of threads: 3
duration: 300 s
number of transactions actually processed: 496582
latency average = 48.333 ms
tps = 1655.192517 (including connections establishing)
tps = 1655.222441 (excluding connections establishing)
statement latencies in milliseconds:
         0.001  \set aid random(1, 100000 * :scale)
         0.001  \set bid random(1, 1 * :scale)
         0.001  \set tid random(1, 10 * :scale)
         0.001  \set delta random(-5000, 5000)
         0.459  BEGIN;
         0.651  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
         0.564  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
         0.620  UPDATE pgbench_tellers SET tbalance = tbalance + :delta WHERE tid = :tid;
         2.027  UPDATE pgbench_branches SET bbalance = bbalance + :delta WHERE bid = :bid;
         0.282  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
        43.745  END;